---
kind: other
id: Methods.T:Autodesk.Revit.DB.CitySetIterator
source: html/fa716ad3-f443-24a9-2a52-1451cbe13d48.htm
---
# CitySetIterator Methods

Causes the object to release immediately any resources it may be utilizing.